# 9 Useful `pandas` Methods You Might Have Not Heard About

## Setup

In [1]:
import pandas as pd
import numpy as np

## 1. `hasnans`

In [2]:
df = pd.DataFrame(data={"a": [1, 2, 3],
                        "b": [4, np.nan, 6]})
df

   a    b
0  1  4.0
1  2  NaN
2  3  6.0

In [3]:
df["b"].isna().any()

True

In [4]:
df["b"].hasnans

True

In [5]:
[df[col].hasnans for col in df.columns]

[False, True]

## 2. `transform`

In [6]:
df = pd.DataFrame(data={"shop_id": [1, 1, 1, 2, 2, 2, 3, 3],
                        "sales": [10, 40, 50, 20, 20, 40, 20, 50]})
df

   shop_id  sales
0        1     10
1        1     40
2        1     50
3        2     20
4        2     20
5        2     40
6        3     20
7        3     50

In [7]:
df["total_sales_per_shop"] = df.groupby("shop_id")["sales"].transform("sum")
df

   shop_id  sales  total_sales_per_shop
0        1     10                   100
1        1     40                   100
2        1     50                   100
3        2     20                    80
4        2     20                    80
5        2     40                    80
6        3     20                    70
7        3     50                    70

In [8]:
df = pd.DataFrame(data={"shop_id": [1, 1, 1, 2, 2, 2, 3, 3],
                        "sales": [10, 40, 50, 20, 20, 40, 20, 50]})
df.loc[df.groupby("shop_id")["sales"].transform("sum") > 75]

   shop_id  sales
0        1     10
1        1     40
2        1     50
3        2     20
4        2     20
5        2     40

## 3. `merge_asof`

In [9]:
trades = pd.DataFrame(
       {
           "time": [
               pd.Timestamp("2016-05-25 13:30:00.023"),
               pd.Timestamp("2016-05-25 13:30:00.038"),
               pd.Timestamp("2016-05-25 13:30:00.048"),
               pd.Timestamp("2016-05-25 13:30:00.048"),
               pd.Timestamp("2016-05-25 13:30:00.048")
           ],
           "ticker": ["MSFT", "MSFT", "GOOG", "GOOG", "AAPL"],
           "price": [51.95, 51.95, 720.77, 720.92, 98.0],
           "quantity": [75, 155, 100, 100, 100]
       }
   )
trades

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.038   MSFT   51.95       155     NaN     NaN
2 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
3 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93
4 2016-05-25 13:30:00.048   AAPL   98.00       100     NaN     NaN

In [20]:
quotes = pd.DataFrame(
    {
        "time": [
            pd.Timestamp("2016-05-25 13:30:00.023"),
            pd.Timestamp("2016-05-25 13:30:00.023"),
            pd.Timestamp("2016-05-25 13:30:00.030"),
            pd.Timestamp("2016-05-25 13:30:00.041"),
            pd.Timestamp("2016-05-25 13:30:00.048"),
            pd.Timestamp("2016-05-25 13:30:00.049"),
            pd.Timestamp("2016-05-25 13:30:00.072"),
            pd.Timestamp("2016-05-25 13:30:00.075")
        ],
        "ticker": [
               "GOOG",
               "MSFT",
               "MSFT",
               "MSFT",
               "GOOG",
               "AAPL",
               "GOOG",
               "MSFT"
           ],
           "bid": [720.50, 51.95, 51.97, 51.99, 720.50, 97.99, 720.50, 52.01],
           "ask": [720.93, 51.96, 51.98, 52.00, 720.93, 98.01, 720.88, 52.03]
    }
)
quotes

                     time ticker     bid     ask
0 2016-05-25 13:30:00.023   GOOG  720.50  720.93
1 2016-05-25 13:30:00.023   MSFT   51.95   51.96
2 2016-05-25 13:30:00.030   MSFT   51.97   51.98
3 2016-05-25 13:30:00.041   MSFT   51.99   52.00
4 2016-05-25 13:30:00.048   GOOG  720.50  720.93
5 2016-05-25 13:30:00.049   AAPL   97.99   98.01
6 2016-05-25 13:30:00.072   GOOG  720.50  720.88
7 2016-05-25 13:30:00.075   MSFT   52.01   52.03

In [21]:
df = pd.merge_asof(
    trades, quotes, on="time", by="ticker", tolerance=pd.Timedelta("2ms")
)
df

                     time ticker   price  quantity     bid     ask
0 2016-05-25 13:30:00.023   MSFT   51.95        75   51.95   51.96
1 2016-05-25 13:30:00.038   MSFT   51.95       155     NaN     NaN
2 2016-05-25 13:30:00.048   GOOG  720.77       100  720.50  720.93
3 2016-05-25 13:30:00.048   GOOG  720.92       100  720.50  720.93
4 2016-05-25 13:30:00.048   AAPL   98.00       100     NaN     NaN

## 4. `insert`

In [10]:
df = pd.DataFrame(data={"a": [1, 2, 3],
                        "b": [4, np.nan, 6]})

df.insert(0, "first", [1, 2, 3])
df

   first  a    b
0      1  1  4.0
1      2  2  NaN
2      3  3  6.0

## 5. `explode`

In [11]:
df = pd.DataFrame(data={"id": [1, 2], 
                        "values": [[1, 2, 3], [4, 5, 6]]})
df

   id     values
0   1  [1, 2, 3]
1   2  [4, 5, 6]

In [12]:
df.explode("values", ignore_index=True)

   id values
0   1      1
1   1      2
2   1      3
3   2      4
4   2      5
5   2      6

## 6. `str` methods

In [13]:
df = pd.DataFrame(data={
    "address": ["1st Street, New York, NY 10000, USA", 
                "2nd Street, New York, NY 10001, USA"]
})
df

                               address
0  1st Street, New York, NY 10000, USA
1  2nd Street, New York, NY 10001, USA

In [14]:
df = df["address"].str.split(",", expand=True)
df.columns = ["street", "city", "zip_code", "country"]
df

       street       city   zip_code country
0  1st Street   New York   NY 10000     USA
1  2nd Street   New York   NY 10001     USA

## 7. `read_clipboard`

In [ ]:
pd.read_clipboard()

## 8. `eval`

In [16]:
df = pd.DataFrame(data={"a": [1, 2, 3],
                        "b": [4, 5, 6]})
df = df.eval("c = a * b")
df

   a  b   c
0  1  4   4
1  2  5  10
2  3  6  18

## 9. `squeeze`

In [17]:
df = pd.DataFrame(data={"a": [1, 2, 3],
                        "b": [4, np.nan, 6]})

In [18]:
df.loc[df["a"] == 3, "b"]

2    6.0
Name: b, dtype: float64

In [19]:
df.loc[df["a"] == 3, "b"].squeeze()

6.0